Tekla Open API Reference for Tekla Structures 2025
Phase.SetUserProperty Method
Overload List
Name | Description
SetUserProperty(String, Double)
 Sets a double property for the phase.
SetUserProperty(String, Int32)
 Sets an integer property for the phase.
SetUserProperty(String, String)
 Sets a string property for the phase.
Top
See Also
Reference
Phase Class
Tekla.Structures.Model Namespace